app/controllers/home_controller.rb

  def create_review
    @review = Review.new(review_params)
    @review[:users_id] = current_user.id
    if @review.save
---
INSERT INTO `reviews` (`review_description`, `created_at`, `updated_at`, `users_id`) VALUES ('', '2022-07-27 11:20:50.475135', '2022-07-27 11:20:50.475135', 1)

  def create_donate
   @donatinglist = DonatingList.new(donate_params)
   if @donatinglist.save
---
INSERT INTO `donating_lists` (`name`, `book_name`, `mobile`, `address`, `created_at`, `updated_at`) VALUES ('zxdc', 'xzsc', 0, 'xzscd', '2022-07-21 07:20:45.097474', '2022-07-21 07:20:45.097474')