app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `mobile`, `email`, `password_digest`, `batch`, `created_at`, `updated_at`, `roles_id`) VALUES ('Jerusheya', 9363232559, 'jerusheya2002@gmail.com', '$2a$12$crWB32qc9Zn/iaIUtSkS.OQ5vF6tXXQPfggQvp0DwMDew1tEU8Y7u', 2, '2022-07-21 09:58:41.982051', '2022-07-21 09:58:41.982051', 1)
---
  def create
    @user = User.new(user_params)
    @user[:roles_id] = 3
      if @user.save